function averageMark(a, g, p) {
    // реализуйте здесь задание №1
    // раскомментируйте следующую строку и верните результат (строку выше и эту удалите)
    // return 0;
}

function sayHello(userName) {
    // реализуйте здесь задание №2
    // раскомментируйте следующую строку и верните результат (строку выше и эту удалите)
    // return "Привет";
}

function calculateFormula() {
    // реализуйте здесь задание №3
    // раскомментируйте следующую строку и верните результат (строку выше и эту удалите)
    // return 0;
}
